{"seminars":
 [{ "title": "Neural Discourse Parsing",
    "speaker": "Te Rutherford",
    "url": "http://www.cs.brandeis.edu/~tet/",
    "date": "March 23rd, 2016",
    "abstract": "Inferring  implicit  discourse  relations  in natural language text is the most difficult subtask in discourse parsing.   Many neural network models have been proposed to tackle  this  problem.   However,  the  comparison  for  this  task  is  not  unified,  so we  could  hardly  draw  clear  conclusions about  the  effectiveness  of  various  architectures.    Here,  we  propose  neural  network  models  that  are  based  on  feedforward and long-short term memory architecture and systematically study the effects of varying structures.  To our surprise, the best-configured  feedforward  architecture outperforms  LSTM-based  model  in  most cases  despite  thorough  tuning.    Further, we compare our best feedforward system with competitive convolutional and recurrent  networks  and  find  that  feedforward can actually be more effective. For the first time  for  this  task,  we  compile  and  publish outputs from previous neural and non-neural systems to establish the standard for further comparison.",
    "paper": "neural_discourse_final.pdf"
  },
  
  { "title": "Route Assignment for Autonomous Vehicles",
    "speaker": "Nick Moran",
    "url": "http://www.cs.brandeis.edu/~nemtiax/",
    "date": "April 6th, 2016",
    "abstract": "We demonstrate a self-organizing, multi-agent system to generate approximate solutions to the route assignment problem for a large number of vehicles across many origins and destinations. Our algorithm produces a set of mixed strategies over the set of paths through the network, which are suitable for use by autonomous vehicles in the absence of centralized control or coordination. Our approach combines ideas from co-evolutionary dynamics in which many species coordinate and compete for efficient navigation, and ideas from swarm intelligence in which many simple agents self-organize into successful behavior using limited between-agent communication. Experiments demonstrate a marked improvement of both individual and total travel times as compared to greedy uncoordinated strategies, and we analyze the differences in outcomes for various routes as the simulation progresses.",
    "paper": "MoranPollackRouting16.pdf"
  },
  
  { "title": "Condensed Memory Networks for Clinical Diagnostic Inferencing",
    "speaker": "Aaditya Prakash",
    "url": "https://iamaaditya.github.io/",
    "date": "September 21st, 2016",
    "abstract": "Diagnosis of a clinical condition is a challenging task, which often  requires  significant  medical  investigation.  Previous work related to diagnostic inferencing problems mostly consider multivariate observational data (e.g. physiological signals, lab tests etc.). In contrast, we explore the problem using free-text medical notes recorded in an electronic health record (EHR). Complex tasks like these can benefit from structured knowledge bases, but those are not scalable. We instead exploit raw text from Wikipedia as a knowledge source. Memory networks have been demonstrated to be effective in tasks which require comprehension of free-form text. They use the final iteration of the learned representation to predict probable  classes.  We  introduce  condensed  memory  neural networks (C-MemNNs), a novel model with iterative condensation of memory representations that preserves the hierarchy of features in the memory. Experiments on the MIMIC-III dataset show that the proposed model outperforms other variants of memory networks to predict the most probable diagnoses given a complex clinical scenario.",
    "paper": "cmn.pdf"
  },
  
  { "title": "Workload Management for Cloud Databases via Machine Learning",
    "speaker": "Ryan Marcus",
    "url": "https://rmarcus.info",
    "date": "October 19th, 2016",
    "abstract": "Workload management for cloud databases deals with the tasks of resource provisioning, query placement, and query scheduling in a manner that meets the application’s performance goals while minimizing the cost of using cloud resources.  Existing solutions have approached these three challenges in isolation while aiming to optimize  a  single  performance  metric.   In  this  paper,  we  introduce WiSeDB, a learning-based framework for generating holistic workload management solutions customized to application-defined performance goals and workload characteristics.  Our approach relies on supervised learning to train cost-effective decision tree models for guiding query placement, scheduling, and resource provisioning decisions. Applications can use these models for both batch and online scheduling of incoming workloads. A unique feature of our system is that it can adapt its offline model to stricter/looser performance goals with minimal re-training. This allows us to present to the application alternative workload management strategies that address the typical performance vs. cost trade-off of cloud services. Experimental results show that our approach has very low training overhead while offering low cost strategies for a variety of performance metrics and workload characteristics.",
    "paper": "wisedb.pdf"
  },
  
  {"title": "Effects of Cooperative and Competitive Coevolution on Complexity in a Linguistic Prediction Game",
   "speaker": "Nick Moran",
   "url": "http://www.cs.brandeis.edu/~nemtiax/",
   "date": "November 8th, 2017",
   "abstract": "We propose a linguistic prediction game with competitive and cooperative variants, and a model of game players based on finite state automata. We present a complexity metric for these automata, and study the coevolutionary dynamics of complexity growth in a variety of multi-species simulations. We present quantitative results using this complexity metric and analyze the causes of varying rates of complexity growth across different types of interactions. We find that while both purely competitive and purely cooperative coevolution are able to drive complexity growth above the rate of genetic drift, mixed systems with both competitive and cooperative interactions achieve significantly higher evolved complexity.",
   "paper": "ecal_a_051.pdf"
  },

  {"title": "Deep networks are easily fooled by adversarial models, but adversarial models can be fooled too",
   "speaker": "Aaditya Prakash",
   "url": "https://iamaaditya.github.io/",
   "date": "November 29th, 2017",
   "abstract": "CNNs are poised to become integral parts of many critical systems. Despite their robustness to natural variations, image pixel values can be manipulated, via small, carefully crafted, imperceptible perturbations, to cause a model to misclassify images. We present an algorithm to process an image so that classification accuracy is significantly preserved in the presence of such adversarial manipulations. Image classifiers tend to be robust to natural noise, and adversarial attacks tend to be agnostic to object location. These observations motivate our strategy, which leverages model robustness to defend against adversarial perturbations by forcing the image to match natural image statistics. Our algorithm locally corrupts the image by redistributing pixel values via a process we term pixel deflection. A subsequent wavelet-based denoising operation softens this corruption, as well as some of the adversarial changes. We demonstrate experimentally that the combination of these techniques enables the effective recovery of the true class, against a variety of robust attacks. Our results compare favorably with current state-of-the-art defenses, without requiring retraining or modifying the CNN.",
   "paper": "pixeldef.pdf"
  },

  {"title": "Virtual agents learn to enact actions: reinforced eventive learning",
   "speaker": "Tuan Do",
   "date": "January 31st, 2018",
   "abstract": "In this talk I will introduce a framework in which virtual agents learn to enact complex temporal-spatial actions by observing humans. My framework processes motion capture data of human subjects performing actions, and uses sequential modeling on qualitative spatial features to learn representations of these actions. Using reinforcement learning, these observed sequences are used to guide a simulated agent to perform novel actions.",
   "paper": "DoQR.pdf"
  },

  {"title": "A Personalized Reading Coach using Wearable EEG Sensors",
   "speaker": "Xiaodong Qu",
   "date": "March 7th, 2018",
   "abstract": "The advent of wearable consumer-grade brainwave sensors opens the possibility of building educational technology that can provide reliable feedback about the focus and attention of a student who is engaged in a learning activity. In this paper, we demonstrate the practicality of developing a simple web-based application that exploits EEG data to monitor reading effectiveness personalized for individual readers. Our tool uses a variant of k-means classification on the relative power of the five standard bands (alpha, beta, gamma, delta, theta) for each of four electrodes on the Muse wearable brainwave sensor. We demonstrate that after 30 minutes of training, our relatively simple approach is able to successfully distinguish between brain signals produced when the subject engages in reading versus when they are relaxing. The accuracy of classification varied across the 10 subjects from 55% to 85% with a mean of 71%. The standard approach to recognize relaxation is to look for strong alpha and/or theta signals and it is reasonably effective but is most associated with closed eye relaxation and it does not allow for personalization. Our k-means classification approach provides a personalized classifier which distinguishes open eye relaxation from reading and has the potential to detect a wide variety of different cognitive states.",
   "paper": "personalized-reading-coach.pdf"
  },

  {"title": "RQL: Retrospective Computations over Snapshot Sets",
   "speaker": "Nikos Tsikoudis",
   "url": "http://www.cs.brandeis.edu/~tsikudis/",
   "date": "March 21st, 2018",
   "abstract": "Applications need to analyze the past state of their data to provide auditing and other forms of fact checking. Retrospective snapshot systems that support computations over data store snapshots, allow applications using simple data stores like Berkeley DB or SQLite, to provide past state analysis in a convenient way. Current snapshot systems however, offer no satisfactory support for computations that analyze multiple snapshots. We have developed a Retrospective Query Language (RQL), a simple declarative extension to SQL that allows to specify and run multi-snapshot computations conveniently in a snapshot system, using a small number of simple mechanisms defined in terms of relational constructs familiar to programmers. We describe RQL mechanisms, explain how they translate into SQL computations in a snapshot system, and show how to express a number of common analysis patterns with illustrative examples. We also describe how we implemented RQL in a simple way utilizing SQLite UDF framework in a Berkeley DB data store using Retro page-level incremental snapshot system. Multi-snapshot computations running over page-level incremental snapshots bring up interesting performance issues that have not been studied before. We present the first study defining a performance envelope for multi-snapshot computations over page-level incremental snapshots.",
   "paper": "paper-336.pdf"
  },

  {"title": "NashDB: An End-to-End Economic Method for Elastic Database Fragmentation, Replication, and Provisioning",
   "speaker": "Ryan Marcus",
   "url": "https://rmarcus.info",
   "date": "April 17th, 2018",
   "abstract": "Distributed data management systems often operate on “elastic” clusters that can scale up or down on demand. These systems face numerous challenges, including data fragmentation, replication, and cluster sizing. Unfortunately, these challenges have traditionally been treated independently, leaving administrators with little insight on how the interplay of these decisions affects query performance. This paper introduces NashDB, an adaptive data distribution framework that relies on an economic model to automatically balance the supply and demand of data fragments, replicas, and cluster nodes. NashDB adapts its decisions to query priorities and shifting workloads, while avoiding underutilized cluster nodes and redun dant replicas. This paper introduces and evaluates NashDB’s model, as well as a suite of optimization techniques designed to efficiently identify data distribution schemes that match workload demands and transition the system to this new scheme with minimum data transfer overhead. Experimentally, we show that NashDB is often Pareto dominant compared to other solutions.",
   "paper": "nashdb.pdf"
  }
 ]
}


